# Additional taps
tap "homebrew/bundle"
tap "homebrew/cask "
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "federico-terzi/espanso"
tap "homebrew-ffmpeg/ffmpeg"
tap "mczachurski/wallpapper"
tap "benwebber/tunnelblickctl"
brew "mackup"
brew "mas "
brew "node"

# Hardware Support
cask "burn"
cask "blackhole"
cask "duet"
cask "epoccam"
cask "monitorcontrol"
cask "paragon-ntfs"
cask "gopro-webcam"
cask "ftdi-vcp-driver"
mas "DiskSpeedTest",id:425264550

# DE
cask "bartender"
cask "spaceman"
cask "spaceman"
cask "rectangle"
cask "intellidock"
cask "hocus-focus"
cask "ubersicht"
cask "alt-tab"
mas "DragQueen",id:962747601

## QuickLook Plugins
brew "qlmarkdown"
brew "quicklook-json"
brew "betterzip"
brew "suspicious-package"
brew "qlvideo"

# Utility
cask "boop"
cask "cheatsheet"
cask "espanso"
cask "fluor"
cask "keka"
cask "kekaexternalhelper"
cask "openinterminal-lite"
cask "alt-tab"
cask "flycut"
mas "Amphetamine",id:937984704
mas "TeraCopy",id:1378806557

# System Configuration & Maintenance
brew "tccutil"
cask "brewservicesmenubar"
brew "organize-tool"
brew "wallpapper"
cask "appcleaner"
cask "clean-me"
mas "CleanMyDrive2",id:523620159

# Security
brew "tor",restart_service:false
cask "cryptomator"
cask "knockknock"
cask "suspicious-package"
cask "veracrypt"
cask "little-snitch"
cask "micro-snitch"
cask "tunnelblick"
cask "disk-arbitrator"
cask "bitwarden"
cask "linkliar"

# Browser
cask "chromium"
cask "firefox"

# #Safari Addons
mas "AdGuardforSafari",id:1440147259

# Communications
cask "pliim"
cask "utterly"
cask "zoom"
cask "signal"
cask "microsoft-teams"

# Office & Productivity
cask "pdf-expert"
cask "skim"
cask "appflowy"
cask "logseq"

# Browsers
cask "chromium"
cask "firefox"

# Other
cask "anki"
mas "Parcel",id:639968404

# Newsfeed
mas "Reeder",id:1529448980
mas "Comet",id:1146204813

# Multimedia
brew "homebrew-ffmpeg/ffmpeg/ffmpeg--with-vorbis--with-opus"
cask "iina"
cask "spotify"
cask "xld"
cask "obs"
cask "obs-virtualcam"
cask "pika"
mas "iMovie",id:408981434
mas "GarageBand",id:682658836

# Developing
cask "cyberduck"
cask "iterm2"
cask "vscodium"
mas "Snip",id:1527428847
mas "CotEditor",id:1024640650

## Python
brew "pyenv"
brew "virtualenv"
brew "pyenv-virtualenv"
brew "tcl-tk"
cask "jupyter-notebook-viewer"

## Container
brew "hyperkit"
brew "minikube"

# CLI/TUI
brew "task"
brew "taskwarrior-tui"
brew "timewarrior"
brew "spotifyd", restart_service:false
brew "spotify-tui"
brew "tunnelblickctl"
brew "timg"
brew "darkmode"
brew "lazygit"
brew "syncthing"
brew "mdcat"
brew "glow"
brew "termshark"
brew "m-cli"
brew "aria2"
brew "bitwarden-cli"
brew "fswatch"
brew "jrnl"

## ZSH Customization
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# ForensicToolkit
brew "sleuthkit"
brew "dcfldd"
brew "dc3dd"
brew "mitmproxy"
brew "httpie"
brew "tcpdump"
brew "hashcat"
cask "autopsy"
cask "wireshark"



